Repository: mor1/oasis
Catalog: po/*.po
Languages: fr

source: (__mandatory__)
fr: (__obligatoire__)

source: Create a developper mode setup.ml. It will be automatically updated at each run.
fr: Crée un setup.ml en mode développement. Il sera mis à jour à chaque lancement.

source: Display extended help
fr: Affiche l'aide étendue

source: Don't catch exception, useful for debugging.
fr: Ne pas rattraper les exceptions, utile pour debugger.

source: Launch an helper to write `_oasis` file.
fr: Lance une aide à l'écriture du fichier `_oasis`.

source: Output debug message
fr: Imprime les messages de debug

source: Quickstart level, skip questions according to this level.
fr: Niveau pour quickstart, ignore les questions ne correspondant pas au niveau.

source: Run quietly
fr: Mode silencieux.

source: [default]
fr: [défaut]

source: '%s' contains unbalanced curly braces
fr: '%s' contient des accolades non-équilibrées

source: '%s' is not valid answer
fr: '%s' n'est pas une réponse valide

source: (default exists)
fr: (une valeur par défaut existe)

source: (default exists, type '?' for help)
fr: (une valeur par défaut existe, taper '?' pour l'aide)

source: (default is '%s')
fr: (la valeur par défaut est '%s')

source: (default is '%s', type '?' for help)
fr: (la valeur par défaut est '%s', taper '?' pour l'aide)

source: (type '?' for help)
fr: (taper '?' pour l'aide)

source: -cclib arguments to use when building.
fr: -cclib arguments à utiliser pour la construction

source: -ccopt arguments to use when building.
fr: -ccopt arguments à utiliser pour la construction

source: -dlllib arguments to use when building.
fr: -dlllib arguments à utiliser pour la construction.

source: -dllpath arguments to use when building.
fr: -dllpath arguments à utiliser pour la construction.

source: .ml file
fr: fichier .ml

source: <empty>
fr: <vide>

source: Action fail with error: %s
fr: L'action a échouée avec l'erreur : %s

source: Authors of the document.
fr: Auteurs du document.

source: Blackbox type cannot be set to the value '%s'
fr: Les valeurs de type boite noire ne peuvent être affectées à la valeur '%s'

source: Build documentation associated to the library.
fr: Construit la documentation associé à la librairie.

source: Build system.
fr: Système de construction.

source: Building documentation '%s'
fr: Construction de la documentation '%s'

source: C source files.
fr: Fichiers source C.

source: CVS requires a named module, as each CVS server can host multiple named repositories. (__mandatory__ for CVS)
fr: CVS a besoin du nom d'un module, car les serveurs CVS peuvent contenir plusieurs dépot de sources (__obligatoire__ pour CVS)

source: Cannot find buildable internal executable '%s' when checking build depends
fr: Impossible un exécutable interne '%s' à construire pendant la vérification des dépendances de construction

source: Cannot find buildable internal library '%s' when checking build depends
fr: Impossible de trouver une librairie interne '%s' à construire pendant la vérification des dépendances de construction

source: Cannot find field '%s' in '%s -config' output
fr: Impossible de trouver le champ '%s' dans la sortie de la commande '%s -config'

source: Cannot find file '%s' for findlib library %s
fr: Impossible de trouver le fichier '%s' pour la librairie findlib %s

source: Cannot find license exception '%s'
fr: Impossible de trouver l'exception '%s' à la licence

source: Cannot find license short name
fr: Impossible de trouver le nom court de la licence

source: Cannot find license shortname '%s'
fr: Impossible de trouver le nom court de la license '%s'

source: Cannot find plugin %s matching section %s for %s action
fr: Impossible de trouver le plugin %s correspondant à la section %s pour l'action %s

source: Cannot find source file matching module '%s' in library %s
fr: Impossible de trouver le fichier source correspondante au module '%s' de la librairie %s

source: Cannot find source header for module %s in library %s
fr: Impossible de trouver le fichier source d'en-tête pour le module %s de la librairie %s

source: Cannot handle os_type %s filename concat
fr: Impossible de gérer la concaténation de nom de fichier pour l'OS %s

source: Cannot parse field '%s' when setting value %S
fr: Impossible d'analyser '%s' pour mettre à jour la valeur %S

source: Cannot parse license '%s'
fr: Impossible d'analyser la licence '%s'

source: Cannot satisfy version constraint on %s: %s (version: %s)
fr: Impossible de satisfaire la contrainte de version sur %s : %s (version : %s)

source: Cannot use versioned build depends on internal library %s in %s
fr: Impossible d'utiliser une dépendance avec version pour la librairie interne %s dans %s

source: Changing directory to '%s'
fr: Changement de répertoire vers '%s'

source: Comma separated list of files to be installed for run-time. ([see here](#data-files))
fr: Liste de fichiers, séparée par des virgules, à installer pour l'exécution ([voir ici](#data-files))

source: Command '%s' fail with error: %s
fr: La commande '%s' a échouée avec l'erreur : %s

source: Command '%s' terminated with error code %d
fr: La commande '%s' s'est terminée avec un code d'erreur %d

source: Command return unexpected output %S
fr: La commande a émis des données non attendue %S

source: Command to run after build.
fr: Commande à lancer après la construction.

source: Command to run after building the doc.
fr: Commande à lancer après la construction du document.

source: Command to run after clean.
fr: Commande à lancer après le nettoyage.

source: Command to run after configuration.
fr: Commande à lancer après la configuration.

source: Command to run after distclean.
fr: Commande à lancer après le nettoyage en profondeur.

source: Command to run after install.
fr: Commande à lancer après l'installation.

source: Command to run after the test
fr: Commande à lancer après le test.

source: Command to run after uninstall.
fr: Commande à lancer après la désinstallation.

source: Command to run before build.
fr: Commande à lancer avant la construction.

source: Command to run before building the doc.
fr: Commande à lancer avant la construction du document.

source: Command to run before clean.
fr: Commande à lancer avant le nettoyage.

source: Command to run before configuration.
fr: Commande à lancer avant la configuration.

source: Command to run before distclean.
fr: Commande à lancer avant la construction.

source: Command to run before install.
fr: Commande à lancer avant l'installation.

source: Command to run before the test
fr: Commande à lancer avant le test.

source: Command to run before uninstall.
fr: Commande à lancer avant la désinstallation.

source: Command to run for the test.
fr: Commande à lancer pour ce test.

source: Commande line '%s' is invalid
fr: La ligne de commande '%s' n'est pas valide

source: Compile with ocaml debug flag on.
fr: Compilation avec les options de debug d'OCaml.

source: Compile with ocaml profile flag on.
fr: Compiler avec les options de profilage d'OCaml.

source: Configuration system.
fr: Système de configuration.

source: Copying file '%s' to '%s'
fr: Copie du fichier '%s' vers '%s'

source: Copyright must follow the convention '(C) 2008-2009 J.R. Hacker', here it is '%s'
fr: Le champ 'Copyright' doit suivre la convention suivante '(C) 2008-2009 J.R. Hacker' ; sa valeur est '%s' ici

source: Copyright owners.
fr: Détenteur des droit d'auteurs.

source: Create a section?
fr: Créer une section ?

source: Create another section?
fr: Créer une autre section ?

source: Create custom bytecode executable.
fr: Créer un exécutable en mode 'custom'.

source: Creating %s file %!
fr: Crée le fichier %s %!

source: Creating directory '%s'
fr: Création du répertoire '%s'

source: Current maintainers of the package.
fr: Mainteneurs actuels du paquet.

source: DVI documentation
fr: Documentation DVI

source: Default target directory to install data and documentation.
fr: Répertoire cible par défaut pour installer les données et la documentation.

source: Default value for the flag
fr: Valeur par défaut pour ce flag

source: Define a meaningful branch for this repository.
fr: Défini une branche logique pour ce dépôt.

source: Define the compilation type of the section: byte, native or best
fr: Défini le type de compilation pour cette section : byte, native ou best

source: Define the relative path from the root of the repository to the top directory for the package, i.e. the directory containing the package's `_oasis` file.
fr: Défini le chemin relatif depuis la racine du dépôt source vers le répertoire principal du paquet, en d'autre mots le répertoire contenant le fichier `_oasis` du paquet.

source: Dependencies on findlib packages, including internal findlib packages.
fr: Dépendances sur les paquets findlib, incluant les dépendances sur les paquets findlib internes.

source: Directory '%s' is not empty (%s)
fr: Le répertoire '%s' n'est pas vide (%s)

source: Directory containing the section
fr: Répertoire contenant cette section

source: Directory to run the test.
fr: Répertoire depuis lequel lancé le test.

source: Documentation root
fr: Répertoire racine de la documentation

source: Don't know what to do with '%s'
fr: Ne sait que faire avec '%s'

source: Don't know what to do with arguments: '%s'
fr: Ne sait pas que faire de l'argument : '%s'

source: Enable %s file generation.
fr: Activer la création du fichier %s.

source: Enable META generation
fr: Activer la création de fichier META

source: Enable this test.
fr: Activer ce test.

source: Error when parsing expresion '%s' %t: %s
fr: Erreur lors de l'analyse de l'expression '%s' %t %s

source: Error while parsing '%s': %s
fr: Erreur lors de l'analyse de '%s': %s

source: Executable '%s' not yet built.
fr: L'exécutable '%s' n'est pas encore construit.

source: Executable name?
fr: Nom de l'Executable ?

source: Expected built file '%s' doesn't exist
fr: Le fichier '%s', qui devrait construit, n'existe pas

source: Expecting not empty string
fr: La chaîne ne doit pas être vide.

source: Extra plugins to use.
fr: Plugins 'extra' à utiliser.

source: Field %s is not defined in schema %s
fr: Le champs %s n'est pas défini dans le schéma %s

source: Field '%s' cannot be conditional
fr: Le champ '%s' ne peut être conditionnel

source: Field '%s' is already defined in schema '%s'
fr: Le champ '%s' est déjà défini dans le schéma '%s'

source: Field '%s' is not set
fr: La champ %s n'est pas définie

source: Field '%s' is not set: %s
fr: Le champ %s n'est pas assigné: %s

source: File %s already exists
fr: Le fichier %s existe déjà

source: File %s already exists, cannot generate it for dev-mode. Please remove it first.
fr: Le fichier %s existe déjà, impossible de le générer en mode dev. Enlever le d'abord.

source: File %s doesn't exist, creating it.
fr: Le fichier %s n'existe pas, création

source: File %s has changed, doing a backup in %s
fr: Le fichier %s a changé, création d'une sauvegarde dans %s

source: File %s has not changed, skipping
fr: Le fichier %s n'a pas changé, ignoré

source: File '%s' doesn't have '.ab' extension
fr: Le fichier '%s' n'a pas l'extension '.ab'

source: File '%s' has been marked as built for %s but doesn't exist
fr: Le fichier '%s' a été marqué comme construit pour %s mais n'existe pas

source: File containing license.
fr: Fichier contenant la licence.

source: Filename of executable '%s'
fr: Nom de fichier de l'exécutable '%s'

source: Files to generate using environment variable substitution.
fr: Fichiers à créer par remplacement de variables.

source: Findlib package name cannot contain '.'
fr: Le nom d'un paquet findlib ne peut contenir de '.'

source: Flag name?
fr: Nom du Flag ?

source: Format for the document.
fr: Format du document.

source: Generate Makefile
fr: Créer un Makefile

source: Generate configure script
fr: Créer un script configure

source: HTML documentation
fr: Documentation HTML

source: Help for the flag
fr: Aide pour le flag

source: Identify a state corresponding to this particular package version.
fr: Identifie un état correspondant à cette version particulière du paquet.

source: Index is mandatory for format HTML in document %s
fr: L'index est obligatoire pour le document %s au format HTML

source: Index is mandatory for format info in document %s
fr: L'index est obligatoire pour le document %s au format info

source: Index or top-level file for the document, only apply to HTML and Info.
fr: Index ou document de plus haut niveau pour le document, s'applique seulement aux formats HTML et Info.

source: Info documentation
fr: Documentation info

source: Install architecture-dependent files in dir
fr: Répertoire d'installation des fichiers dépendants de l'architecture

source: Install architecture-independent files dir
fr: Répertoire d'installation des fichiers indépendants de l'architecture

source: Install/uninstall system.
fr: Système d'installation/désinstallation.

source: Installing findlib library '%s'
fr: Installe la librairie findlib '%s'

source: Library name?
fr: Nom de la librairie ?

source: Library which includes the current library. The current library will be built as its parents and installed along it.
fr: Librairies qui inclut cette librairie. Elle sera construite et installée en même temps que ses parents.

source: License type of the package.
fr: Type de licence pour le paquet.

source: List of OCaml modules used to generate ocamldoc documentation
fr: Liste des modules OCaml utilisés pour générer la documentation avec ocamldoc

source: List of modules to compile which are not exported.
fr: Liste des modules à compiler qui ne sont pas exportés.

source: List of modules to compile.
fr: Liste des modules à compiler.

source: Locale-dependent data
fr: Données dépendent de la langue

source: Long description of the package purpose.
fr: Description longue de l'intérêt du paquet.

source: META package description
fr: Description du paquet pour le fichier META

source: META type
fr: Type de fichier META

source: Man documentation
fr: Documentation man

source: Missing field in %s: %s
fr: Champs manquant dans %s: %s

source: Modifiable architecture-independent data
fr: Données modifiables indépendantes de l'architecture

source: Modifiable single-machine data
fr: Données modifiables liées à une seule machine

source: Module path '%s' must not contain a ' '
fr: Le chemin pour le module '%s' ne doit pas contenir de ' '

source: Name of the package.
fr: Nom du paquet.

source: Name used by findlib.
fr: Nom utilisé par findlib.

source: No action defined, run '%s %s -help'
fr: Aucune action définie, lancer la commande '%s %s -help'

source: No command
fr: Pas de commande

source: No context defined for field '%s' when parsing value %S
fr: Aucun contexte défini pour le champ '%s' pendant l'analyse de la valeur %S

source: No default printer for value %s
fr: Pas de représentation par défaut pour la valeur %s

source: No exported module defined for library %s
fr: Pas de module exportés définis pour la librairie %s

source: No implementation for %s
fr: Pas d'implémentation pour %s

source: No module defined for documentation of library %s
fr: Pas de module défini pour la documentation de la librairie %s

source: No possible ocamlbuild targets in generated files %s for library %s
fr: Pas de cible ocamlbuild dans les fichiers générés %s pour la librairie %s

source: No replace section found in template for file %s
fr: Pas de section de remplacement trouvée dans le fichier gabarit %s

source: No replace section in file %s
fr: Pas de section de remplacement dans le fichier %s

source: No result for a choice list: %s
fr: Pas de résultat pour une liste de choix : %s

source: No result for the choice list '%s': %s
fr: Pas de résultat pour la liste de choix '%s' : %s

source: No variable %s defined when trying to expand %S.
fr: La variable %s n'est pas définie pour l'évaluation de %S.

source: Nothing to install for findlib library '%s'
fr: Rien à installer pour la librairie findlib '%s'

source: OASIS Package is not set
fr: Le paquet OASIS n'est pas défini

source: OASIS format version '%s' is not supported.
fr: Le format OASIS version '%s' n'est pas supporté.

source: OASIS format version used to write file `_oasis`.
fr: Version du format OASIS utilisé pour écrire le fichier `_oasis`.

source: OCaml file (.ml) containing main procedure for the executable.
fr: Fichier source OCaml (.ml) contenant le point d'entrée principal pour l'executable.

source: Object code libraries
fr: Librairies de code objet

source: PDF documentation
fr: Documentation PDF

source: PS documentation
fr: Documentation PS

source: Package name
fr: Nom du paquet

source: Package version
fr: Version du paquet

source: Plugin %s is defined without version, use current version at least: %s.
fr: Le plugin %s est défini sans version, utilisé au moins la version courante %s.

source: Plugin to use to build documentation.
fr: Plugin à utiliser pour construire la documentation.

source: Plugin to use to run test.
fr: Plugin à utiliser pour lancer le test.

source: Pre/Post Command
fr: Pre/Post commande

source: Prepend a path when installing package
fr: Ajouter un chemin au début lors de l'instation du paquet

source: Program executables
fr: Exécutables utilisés par le programme

source: Read-only arch-independent data root
fr: Racine pour les données indépendantes de l'architecture en lectures seules

source: Read-only architecture-independent data
fr: Données dépendantes de l'architecture en lectures seules

source: Read-only single-machine data
fr: Données liées à une machine en lectures seules

source: Real filename to use for file %s.
fr: Nom de fichier à réellement utiliser pour le fichier %s.

source: Real people that had contributed to the package.
fr: Personnes réelles ayant contribué au paquet

source: Regenerating file %s
fr: Régénère le fichier %s

source: Remove '%s'
fr: Supprime '%s'

source: Remove a directory.
fr: Supprimer un répertoire.

source: Remove a file.
fr: Supprime un fichier.

source: Removing directory '%s'
fr: Supprime le répertoire '%s'

source: Removing file '%s'
fr: Supprime le fichier '%s'

source: Removing findlib library '%s'
fr: Supprime la librairie findlib '%s'

source: Requires field for META package
fr: Champ "requires" pour le paquet du fichier META

source: Run command to build documentation.
fr: Commande à lancer pour construire la documentation.

source: Run command to build.
fr: Commande à lancer pour la construction.

source: Run command to clean build documentation step.
fr: Commande à lancer pour nettoyer après l'étape de documentation.

source: Run command to clean build step.
fr: Commande à lancer pour nettoyer après l'étape de construction.

source: Run command to clean configure step.
fr: Commande à lancer pour nettoyer après l'étape de configuration.

source: Run command to clean install step.
fr: Commande à lancer pour nettoyer après l'étape d'installation.

source: Run command to clean test step.
fr: Commande à lancer pour nettoyer après l'étape de test.

source: Run command to clean uninstall step.
fr: Commande à lancer pour nettoyer après l'étape de désinstallation.

source: Run command to configure.
fr: Commande à lancer pour configurer.

source: Run command to distclean build documentation step.
fr: Commande à lancer pour nettoyer en profondeur après l'étape de construction de la documentation.

source: Run command to distclean build step.
fr: Commande à lancer pour nettoyer en profondeur après l'étape de construction.

source: Run command to distclean configure step.
fr: Commande à lancer pour nettoyer en profondeur après l'étape de configuration.

source: Run command to distclean install step.
fr: Commande à lancer pour nettoyer en profondeur après l'étape d'installation.

source: Run command to distclean test step.
fr: Commande à lancer pour nettoyer en profondeur après l'étape de test.

source: Run command to distclean uninstall step.
fr: Commande à lancer pour nettoyer en profondeur après l'étape de désinstallation.

source: Run command to install.
fr: Commande pour installer.

source: Run command to uninstall.
fr: Commande pour désinstaller.

source: Running command '%s'
fr: Exécute la commande '%s'

source: Running test '%s'
fr: Exécute le test '%s'

source: Section %s requires native compilation
fr: La section %s nécessite une compilation native

source: Set if the section should be built.
fr: Mettre à 'true' si la section doit être construite.

source: Set if the section should be distributed.
fr: Mettre à 'true' si la section doit être distribuée.

source: Setup and run build process current package
fr: Met en place et lance le processus de construction

source: Short description of the purpose of this package.
fr: Description courte de l'intérêt de ce paquet.

source: Short paragraph giving an overview of the document.
fr: Court paragraphe résumant le document.

source: Skipping test '%s'
fr: Ignore le test '%s'

source: Source repository identifier?
fr: Identifiant pour le dépot de code source ?

source: String '%s' is not a %s
fr: La chaîne '%s' n'est pas un %s

source: Syntax error %s %t
fr: Erreur de syntaxe %s %t

source: Syntax error %t
fr: Erreur de syntaxe %t

source: Syntax error when parsing '%s' when trying to expand %S: %s
fr: Erreur de syntaxe en essayant d'analyser '%s' lors de l'expansion de %S : %s

source: System admin executables
fr: Exécutables pour l'administrateur système

source: Targets to disable when generating Makefile
fr: Cibles à désactiver pour la génération du fichier Makefile

source: Test '%s' fails: %s
fr: Le test '%s' a échoué : %s

source: Test name?
fr: Nom du test ?

source: Testing file existence '%s'
fr: Teste l'existence du fichier '%s'

source: Tests had a %.2f%% failure rate
fr: Les tests on un taux de %.2f%% d'erreur

source: Title of the document.
fr: Titre du document.

source: Tools required to compile, including internal executables.
fr: Outils nécessaire à la compilation, incluant les exécutable interne.

source: Tools required to run the test, including internal executables.
fr: Outils requis pour faire tourner le test, incluant les exécutables internes.

source: Top level directory for building ocamldoc documentation
fr: Répertoire racine pour construire la documentation ocamldoc

source: Trying to set field '%s' using mandatory value '%s': %s
fr: Tentative d'utilisation pour le champs '%s' de la valeur obligatoire '%s' : %s

source: Type of META package, set default predicates for archive
fr: Type de paquet pour le fichier META, défini les 'predicates' par défault pour les champs "archive"

source: URL of the package homepage.
fr: URL de la page d'accueil pour le paquet.

source: URL of the repository. The exact form of this field depends on the repository type.
fr: URL du dépôt de code source. La grammaire exacte de ce champ dépend du type de dépôt.

source: URL where the repository can be navigated using a web browser.
fr: URL pouvant être utilisée pour parcourir le dépôt à l'aide d'un navigateur web.

source: URL(s) describing categories of the package.
fr: URL(s) décrivant les catégories auxquels appartient le paquet.

source: Unable to determine root library of findlib library '%s'
fr: Impossible de déterminer le répertoire racine de la librairie findlib '%s'

source: Unable to translate internal library '%s' to findlib name
fr: Impossible de traduire le nom de la librairie interne '%s' en nom de paquet findlib

source: Unexpected abstract choice value for %s
fr: La valeur abstraite ne correspond à aucun choix pour la valeur %s

source: Unknown %s %S (possible: %s)
fr: %s inconnue %S (possible: %s)

source: Unknown OASIS test %s
fr: Test OASIS %s inconnu

source: Unknown build plugin '%s' (available: %s)
fr: Plugin de construction '%s' inconnu (disponible : %s)

source: Unknown expression '%s' in variable expansion of %s.
fr: Expression '%s' inconnue lors de l'expansion des variables dans %s.
