Repository: mor1/oasis
Catalog: po/*.po
Languages: fr

source: Unknown flag '%s'
fr: Flag '%s' inconnu

source: Unknown log event '%s'
fr: Évènement de log '%s' inconnu

source: Unknown variable %s in documentationi (line is '%s')
fr: Variable %s inconnue dans la documentation (la ligne étant '%s')

source: Unkown configure plugin '%s' (available: %s)
fr: Plugin de configuration '%s' inconnu (disponible : %s)

source: Unkown doc plugin '%s' (available: %s)
fr: Plugin de documentation '%s' inconnu (disponible : %s)

source: Unkown extra plugin '%s' (available: %s)
fr: Plugin extra '%s' inconnu (disponible : %s)

source: Unkown install plugin '%s' (available: %s)
fr: Plugin d'installation '%s' inconnu (disponible : %s)

source: Unkown test plugin '%s' (available: %s)
fr: Plugin de test '%s' inconnu (disponible : %s)

source: User executables
fr: Exécutables pour l'utilistateur

source: Using default '%s'.
fr: Utiliser la valeur par défaut '%s'.

source: VCS type.
fr: Type de VCS

source: Value for field '%s'?
fr: Valeur du champs '%s' ?

source: Version constraint on Finblib.
fr: Contraintes sur la version de Findlib.

source: Version constraint on OCaml.
fr: Contraintes sur la version d'OCaml

source: Version of the package.
fr: Version du paquet

source: Virtual containers for sub-package, dot-separated
fr: Conteneurs virtuels pour un sous-paquet, séparer par des points

source: When looking for findlib package %s, directory %s return doesn't exist
fr: Le répertoire %s, retourné par la recherche du paquet findlib %s, n'existe pas

source: Wildcard '%s' doesn't match any files
fr: Le joker '%s' ne correspond à aucun fichier

source: [options*] Build documentation.
fr: [options*] Construit la documentation

source: [options*] Clean build and configure environment.
fr: [options*] Nettoie l'environnement de construction et de configuration.

source: [options*] Clean build environment.
fr: [options*] Nettoie l'environnement de construction.

source: [options*] Configure build process.
fr: [options*] Configure le processus de construction.

source: [options*] Install libraries, data, executables and documentations.
fr: [options*] Installe les librairies, les données, les exécutables et la documentation.

source: [options*] Run build process.
fr: [options*] Exécute la processus de construction.

source: [options*] Run tests.
fr: [options*] Exécute les tests

source: [options*] Uninstall libraries, data, executables and documentations.
fr: [options*] Désinstalle les librairies, les données, les exécutables et la documentation.

source: beginner
fr: débutant

source: boolean
fr: booléen

source: build
fr: construction

source: compiled object
fr: objet compilé

source: configure options:
fr: options de configuration :

source: create a flag
fr: créer une option de configuration

source: create a library
fr: créer une librairie

source: create a source repository
fr: créer un dépot de code source

source: create a test
fr: créer un test

source: create an executable
fr: créer un executable

source: default value of flag %s
fr: valeur par défaut du flag %s

source: dir Change directory before running.
fr: dir Change de répertoire avant le lancement.

source: documentation %s build
fr: documentation %s construite

source: executable %s
fr: l'executable %s

source: fn Change the default name of setup.ml. This option should be used with caution, it is reserved for internal use.
fr: fn Change le nom par défaut du fichier setup.ml. Cette option doit être manipulée avec précaution, elle est réservée pour un usage interne.

source: in file '%s' at line %d, char %d
fr: dans le fichier '%s' à la ligne %d, au caractère %d

source: intermediate
fr: intermédiaire

source: library %s
fr: la librairie %s

source: main command
fr: commande principale

source: no
fr: non

source: no default value
fr: pas de valeur par défaut

source: ocamlc arguments to use when building.
fr: Argument à utiliser avec ocamlc pendant la construction.

source: ocamlopt arguments to use when building.
fr: Arguments à utiliser avec ocamlopt pendant la construction.

source: run
fr: lance

source: source repository
fr: dépot de code source

source: source repository type
fr: type de dépôt de code source

source: stop
fr: arréter

source: target
fr: cible

source: test %s run
fr: lance le test %s

source: undefined by construct
fr: non-défini par construction

source: yes
fr: oui
